#include"graphFunc4.h"
#include"graphFunc3.h"


void menu()      //主菜单
{
	system("cls");
	printf("========================================================           ================================\n"); 
	printf("||                  校园导航咨询系统                  ||           ||          景点内容          ||\n");
	printf("||                                   -made by Group 12||           ||                            ||\n");
	printf("========================================================           ||    1、彭德怀元帅雕像；     ||\n");
	printf("||                                                    ||           ||    2、柏林园；             ||\n");
	printf("||                                                    ||           ||    3、二龙山；             ||\n");
	printf("||                                                    ||           ||    4、科艺苑；             ||\n");
	printf("||                                                    ||           ||    5、校医院；             ||\n");
	printf("||                                                    ||           ||    6、游泳馆；             ||\n");
	printf("||                                                    ||           ||    7、瑾瑜国际会议中心；   ||\n");
	printf("||            1 . 查看校园平面图                      ||           ||    8、教学主楼；           ||\n");
	printf("||            2 . 查询景点的信息                      ||           ||    9、图书馆；             ||\n");
	printf("||            3 . 查询任意两景点的所有路径            ||           ||    10、主体育场。          ||\n");
	printf("||            4 . 查询途径多个景点的最佳路径          ||           ||                            ||\n");
	printf("||            5 . 查询任意两景点的最短路径            ||           ================================\n");
	printf("||            0 . 退出本系统                          ||                                           \n");
	printf("||                                                    ||                                           \n");
	printf("||                                                    ||                                           \n");
	printf("||                                                    ||                                           \n");
	printf("||                                                    ||                                           \n");
	printf("||                                                    ||                                           \n");
	printf("||                                                    ||                                           \n");
	printf("||                                                    ||                                           \n");
	printf("========================================================                                           \n");
    printf("请输入要进行操作的编号：");
}



void to_menu()     //返回主菜单的函数
{ 
    char c1,c2;      
	printf("\n\n\n按回车键返回主菜单...");     
	scanf("%c%c",&c2, &c2);
	menu(); 
}




